package poly.util;

import org.apache.log4j.Logger;

/* @Auth 최별규
 * @Version 1.1
 * UTIL 테스트를 위한 메인메서드 부 
 *  ____________________________________________________________________________________
 * |   작성일     |   작성자    |                          내용                        |
 * |------------------------------------------------------------------------------------
 * | 2021.07.11   |  최별규     | 초안 작성
 * |              |             |
 * */
//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!마음 껏 코드를 작성하길!!!!!!!!!!!!!!!!!!!!!!!
//-----------------------------------------이너클래스 생성부----------------------------
class InnerClass{
	
}
//--------------------------------------------------------------------------------------
public class testArea {
	private Logger log = Logger.getLogger(this.getClass().getName());
	//-------------------------------------전역변수 선언부-----------------------------
	
	//---------------------------------------------------------------------------------
	//---------------------------------------메인메서드부------------------------------
	public static void main(String[] args) {
		String acc = "R91p3gxnhe5bNW3Be1Gf6m9K-uusXVe_yNhuDwopyNgAAAF8G4zJtQ";		
		KakaoClass kc = new KakaoClass();
		kc.sendMyKakaoTalk(acc, "1번 센서에서 많은 양의 가스가 탐지되었습니다.", "/");
		
		System.out.print("topic : " + "hardwareCon" + "message : " + "1");
	}

}
